src/Enums/РежимыЗапускаУНФ/РежимыЗапускаУНФ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыЗапускаУНФ</name>
  <enumValues>
    <name>НастольноеПриложение</name>
  </enumValues>
  <enumValues>
    <name>МобильноеПриложение</name>
  </enumValues>
  <enumValues>
    <name>МобильноеПриложение20</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/ПодсистемаМобильныеПриложения/Module.bsl
#Область ПрограммныйИнтерфейс

// См. ОбновлениеИнформационнойБазыУНФ.ОбновлениеРозницыДоУНФ
Процедура ОбновлениеРозницыДоУНФ() Экспорт
	
	УстановитьКонстантыОбновленияРозницыДоУНФ();
	ЗаполнитьДанныеПриПереходеСРозницы();
	
КонецПроцедуры

// Процедура выполняет первоначальное заполнение данных подсистемы и включение функциональности при первом запуске приложения
//
Процедура ПриПервомЗапуске() Экспорт
	
	УстановитьКонстантыНачальногоЗаполнения();
	ПервоначальноеЗаполнениеОбъектовПодсистемы();
	
КонецПроцедуры

// Процедура выполняет первоначальное заполнение данных подсистемы
//
Процедура ПервоначальноеЗаполнениеОбъектовПодсистемы() Экспорт
	Возврат;
КонецПроцедуры

// Процедура выполняет первоначальное включение функциональности подсистемы
//
Процедура УстановитьКонстантыНачальногоЗаполнения()
	
	РежимЗапускаУНФ = Константы.ТекущийРежимЗапускаУНФ.Получить();
	ЭтоРозница 		= ВозможностиПриложения.ЭтоРозница();
	ЭтоУНФ 			= ВозможностиПриложения.ЭтоУНФ();
	
	ЭтоНастольноеПриложениеУНФ 	= ЭтоУНФ И РежимЗапускаУНФ = Перечисления.РежимыЗапускаУНФ.НастольноеПриложение;
	ЭтоМобильноеПриложениеУНФ 	= ЭтоУНФ И РежимЗапускаУНФ = Перечисления.РежимыЗапускаУНФ.МобильноеПриложение;
	ЭтоМобильноеПриложениеУНФ20 = ЭтоУНФ И РежимЗапускаУНФ = Перечисления.РежимыЗапускаУНФ.МобильноеПриложение20;
	
	Если ЭтоНастольноеПриложениеУНФ ИЛИ ЭтоМобильноеПриложениеУНФ Или ЭтоРозница Тогда
		Константы.ОтображатьКомандуПереходаКМП.Установить(Истина);
	КонецЕсли;
	
	Если ЭтоМобильноеПриложениеУНФ20 Тогда
		Константы.ОтображатьМусорнуюКорзину.Установить(Истина);
		Константы.ИспользоватьФормуВиджетаНаНачальнойСтранице.Установить(Истина);
		Константы.ИспользоватьСинхронизациюМП.Установить(Истина);
		Константы.ИспользоватьПодсистемуКомпанияМП.Установить(Истина);
		Константы.ИспользоватьПодсистемуПродажиМП.Установить(Истина);
		Константы.ИспользоватьПодсистемуПроизводствоМП.Установить(Истина);
	КонецЕсли;
	
	Если ЭтоМобильноеПриложениеУНФ Тогда
		Константы.ИспользоватьФормуВиджетаНаНачальнойСтранице.Установить(Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьКонстантыОбновленияРозницыДоУНФ()
	Возврат;
КонецПроцедуры

Процедура ЗаполнитьДанныеПриПереходеСРозницы()
	Возврат;
КонецПроцедуры

#КонецОбласти
